Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArc.AddConstraintChordLength(Autodesk.Revit.DB.ElementId)
Specify a parameter to drive the chord length (the straight-line distance between the endpoints of the arc).
Remarks:
The chord length is measured on the centerline of the bar.
paramId:
Id of a parameter to drive the constraint.
To obtain the id of a shared parameter,
call RebarShape.GetElementIdForExternalDefinition().
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2009

Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArc.AddConstraintSagittaLength(Autodesk.Revit.DB.ElementId)
Specify a parameter to drive the sagittal
length (the height of the circular segment, measured
perpendicular to the chord).
Remarks:
The sagitta will be measured on the centerline of the bar.
paramId:
Id of a parameter to drive the constraint.
To obtain the id of a shared parameter,
call RebarShape.GetElementIdForExternalDefinition().
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2009

Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArc.AddConstraintCircumference(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.RebarShapeArcReferenceType)
Specify a parameter to drive the circumference of the shape.
paramId:
Id of a parameter to drive the constraint.
To obtain the id of a shared parameter,
call RebarShape.GetElementIdForExternalDefinition().
arcRefType:
Specify along which circle the circumference is measured--to the interior
of the bar, the centerline, or the exterior.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2009

Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArc.AddConstraintDiameter(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.RebarShapeArcReferenceType)
Specify a parameter to drive the diameter of the shape.
paramId:
Id of a parameter to drive the constraint.
To obtain the id of a shared parameter,
call RebarShape.GetElementIdForExternalDefinition().
arcRefType:
Specify how the diameter should be measured--to the interior of the bend, the centerline of the bar, or the exterior.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2009

Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArc.AddConstraintRadius(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.RebarShapeArcReferenceType)
Specify a parameter to drive the radius of the shape.
paramId:
Id of a parameter to drive the constraint.
To obtain the id of a shared parameter,
call RebarShape.GetElementIdForExternalDefinition().
arcRefType:
Specify how the radius should be measured--to the interior of the bend, the centerline of the bar, or the exterior.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2009

Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArc.AddConstraintArcLength(Autodesk.Revit.DB.ElementId)
Specify a parameter to drive the arc length of the shape.
paramId:
Id of a parameter to drive the constraint.
To obtain the id of a shared parameter,
call RebarShape.GetElementIdForExternalDefinition().
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2009

Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArc.SetArcTypeSpiral(System.Double,System.Double,System.Int32,System.Int32)
Set the RebarShapeDefinitionByArc.Type property to Spiral.
Remarks:
In order to create a spiral definition, you must provide default values for
height, pitch, and finishing turns.
height:
The height of the spiral (assuming the spiral is vertical).
pitch:
The pitch, or vertical distance traveled in one rotation.
baseFinishingTurns:
The number of finishing turns at the lower end of the spiral.
topFinishingTurns:
The number of finishing turns at the upper end of the spiral.
Throws Autodesk.Revit.Exceptions.ArgumentException:
baseFinishingTurns is not between 0 and 100.
-or-
topFinishingTurns is not between 0 and 100.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for height must be greater than 0 and no more than 30000 feet.
-or-
The given value for pitch must be greater than 0 and no more than 30000 feet.
Since:
2011

Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArc.SetConstraints(System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.RebarShapeConstraint})
Assign a new list of constraints to this definition.
Remarks:
Any existing constraints are discarded. The new constraints replace them.
Any parameters driving the constraints must already be added
with AddParameter().
If the Type is Arc or LappedCircle, the allowable constraint types are:
RebarShapeConstraintArcLengthRebarShapeConstraintRadiusRebarShapeConstraintDiameterRebarShapeConstraintCircumferenceRebarShapeConstraintSagittaLengthRebarShapeConstraintChordLength
At least two independent constraints must be specified. Overconstraining
is supported.
If the Type is Spiral, the allowable constraints are:
RebarShapeConstraintRadiusRebarShapeConstraintDiameterRebarShapeConstraintCircumference
At least one constraint must be specified.
constraints:
A new list of constraints.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more of the constraints is of a type not supported for this definition.
-or-
One or more of the constraints refers to a parameter that has not been added yet.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArc.GetConstraints
Retrieve the list of constraints associated with this definition.
Returns:
The list of constraints.
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArc.Type
Among those rebar shapes defined by an arc, specify which kind.
Remarks:
This property may be explicitly set to Arc or LappedCircle.
But to set the property to Spiral, you must call SetArcTypeSpiral()
and provide default values for the height, pitch, and finishing turns.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The arc type cannot be set directly
to Spiral. Instead, call SetArcTypeSpiral() to provide defaults
for spiral parameters.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2009

Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArc.#ctor(Autodesk.Revit.DB.Document,System.Double,System.Double,System.Int32,System.Int32)
Create a spiral shape definition.
Remarks:
In order to create a spiral definition, you must provide default values for the spiral-specific parameters.
Replaces RebarShape.NewDefinitionByArc() from prior versions.
height:
The height of the spiral (assuming the spiral is vertical).
pitch:
The pitch, or vertical distance traveled in one rotation.
baseFinishingTurns:
The number of finishing turns at the lower end of the spiral.
topFinishingTurns:
The number of finishing turns at the upper end of the spiral.
Throws Autodesk.Revit.Exceptions.ArgumentException:
baseFinishingTurns is not between 0 and 100.
-or-
topFinishingTurns is not between 0 and 100.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for height must be greater than 0 and no more than 30000 feet.
-or-
The given value for pitch must be greater than 0 and no more than 30000 feet.
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArc.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArcType)
Create a non-spiral shape definition.
Remarks:
Replaces RebarShape.NewDefinitionByArc() from prior versions.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The arc type cannot be set directly
to Spiral. Instead, call SetArcTypeSpiral() to provide defaults
for spiral parameters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArc
Definition of a shape whose size and position can determined by a single arc.
Remarks:
In this shape definition, all dimensions are allowed to be driving dimensions.
Since:
2009